{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing two features with associated frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files and components for reference.",
  "frontend/index.css": "Base Tailwind setup defining color variables, dark-mode variants, and global border/background styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app controlling screen flow, loading transitions, and wrapping with theme and sound providers.",
  "frontend/src/game/audio/SoundProvider.tsx": "Context provider for playing simple synthesized sound effects and toggling audio.",
  "frontend/src/game/components/AchievementToast.tsx": "Displays a temporary achievement toast with title and description when triggered.",
  "frontend/src/game/components/ChoiceMiniGame.tsx": "Multiple‑choice mini‑game component handling selection, success/failure feedback, and continuation.",
  "frontend/src/game/components/LootChest.tsx": "Interactive loot chest component that plays sounds, reveals items, and advances on continue.",
  "frontend/src/game/components/PixelHearts.tsx": "Renders floating animated heart emojis with randomized positions and delays.",
  "frontend/src/game/components/RewardToast.tsx": "Shows a temporary toast with an icon and message when triggered.",
  "frontend/src/game/components/SoundToggle.tsx": "Button component that toggles game sound on or off.",
  "frontend/src/game/components/UnlockSequence.tsx": "Displays a sequence of unlockable text items with optional final message and completion handling.",
  "frontend/src/game/flow.ts": "Defines screen IDs, their progression order, and a helper to get the next screen.",
  "frontend/src/game/GameShell.tsx": "Provides shared game layout with background, animated effects, and sound toggle around screen content.",
  "frontend/src/game/screens/BootScreen.tsx": "Simulates a boot/loading sequence and then shows a start button to advance.",
  "frontend/src/game/screens/EndingAchievement.tsx": "Shows the final achievement screen with rewards, animations, and decorative hearts.",
  "frontend/src/game/screens/FakeLoading.tsx": "Displays a fake loading screen with changing messages and a progress bar.",
  "frontend/src/game/screens/FinalProposal.tsx": "Guides the player through several steps ending in a Valentine proposal with interactive responses.",
  "frontend/src/game/screens/index.ts": "Exports all game screen components from a central index file.",
  "frontend/src/game/screens/Level1OriginStory.tsx": "Presents an origin-story sequence using UnlockSequence with a final reward message.",
  "frontend/src/game/screens/Level2MemoryArena.tsx": "Shows a set of memory items via UnlockSequence to progress the story.",
  "frontend/src/game/screens/Level3Reasons.tsx": "Lists reasons the player is liked and triggers a reward toast before advancing.",
  "frontend/src/game/screens/Level4SupportMission.tsx": "Shows supportive moments using UnlockSequence with a final completion message.",
  "frontend/src/game/screens/LobbyScreen.tsx": "Renders a lobby UI showing player info, mode, a pending request card, and a start-match button with sound.",
  "frontend/src/game/screens/MiniGame1Defuse.tsx": "Displays a defuse-themed mini-game using ChoiceMiniGame with predefined scenario, choices, and success state.",
  "frontend/src/game/screens/MiniGame2LootChest.tsx": "Shows a LootChest mini-game that grants a single loot item and advances on completion.",
  "frontend/src/game/screens/MiniGame3Penalty.tsx": "Implements a penalty-themed ChoiceMiniGame with specified question, choices, and success messages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity using react-query, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, authentication handling, and state management via AuthClient.",
  "frontend/src/index.css": "Defines Tailwind layers, custom theme variables, component styles, and animation utilities for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, containers, and enabling plugins.",
  "project_state.json": "Stores project metadata, feature requests, and script requirements for the game proposal experience."
}