{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Defines a feature evidence report specifying files and components related to adding Cristiano Ronaldo static images to the Cute Football mini‑game.",
  "frontend-file-summaries.txt": "JSON-like text containing prewritten summaries of various frontend source files.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and dark mode overrides for the app.",
  "frontend/index.html": "Basic HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app routing component controlling game screen progression and loading states.",
  "frontend/src/game/audio/SoundProvider.tsx": "Audio context provider managing sound toggle state and simple oscillator-based sound effects.",
  "frontend/src/game/components/AchievementToast.tsx": "Displays a temporary achievement toast with title, description, and trophy icon.",
  "frontend/src/game/components/ChoiceMiniGame.tsx": "Reusable multiple-choice mini‑game with success/failure UI and sound effects.",
  "frontend/src/game/components/LootChest.tsx": "Interactive loot chest component revealing items and advancing on completion.",
  "frontend/src/game/components/PixelHearts.tsx": "Generates animated floating heart effects for celebratory moments.",
  "frontend/src/game/components/RewardToast.tsx": "Displays a temporary toast with an icon and message for 3 seconds when triggered.",
  "frontend/src/game/components/SoundToggle.tsx": "Button that toggles game sound on or off using SoundProvider.",
  "frontend/src/game/components/UnlockSequence.tsx": "Handles step-by-step unlock messages with optional final screen and sound effects.",
  "frontend/src/game/flow.ts": "Defines screen IDs and a mapping for determining the next game screen.",
  "frontend/src/game/GameShell.tsx": "Layout wrapper providing background visuals, animated overlays, and the sound toggle around all screens.",
  "frontend/src/game/screens/BootScreen.tsx": "Simulates a boot/loading sequence before showing a start button.",
  "frontend/src/game/screens/EndingAchievement.tsx": "Shows the final achievement screen with rewards, animations, and a badge.",
  "frontend/src/game/screens/FakeLoading.tsx": "Displays a fake loading screen with rotating messages and a progress bar.",
  "frontend/src/game/screens/FinalProposal.tsx": "Runs a multi-step sequence leading to a Valentine proposal with animated choices.",
  "frontend/src/game/screens/index.ts": "Exports all game screen components for unified access.",
  "frontend/src/game/screens/Level1OriginStory.tsx": "Presents an origin story using UnlockSequence with a final reward message.",
  "frontend/src/game/screens/Level2MemoryArena.tsx": "Shows a sequence of memories using UnlockSequence to advance.",
  "frontend/src/game/screens/Level3Reasons.tsx": "Lists reasons the player is liked and triggers a reward toast before advancing.",
  "frontend/src/game/screens/Level4SupportMission.tsx": "Uses UnlockSequence to show supportive moments with a final completion message.",
  "frontend/src/game/screens/LobbyScreen.tsx": "Displays the game lobby with player info, mode, pending request, and a start button.",
  "frontend/src/game/screens/MiniGame1Defuse.tsx": "Renders a choice-based minigame where the player selects the correct action to defuse a bad day.",
  "frontend/src/game/screens/MiniGame2LootChest.tsx": "Shows a loot chest minigame that grants a single reward and advances on completion.",
  "frontend/src/game/screens/MiniGame3Penalty.tsx": "Provides a penalty kick–themed choice minigame where the correct answer wins the round.",
  "frontend/src/game/screens/MiniGameCuteFootball.tsx": "Implements a timing-based football minigame requiring scoring goals by kicking within a power sweet spot.",
  "frontend/src/game/screens/MiniGameHeartCollector.tsx": "Implements a heart‑collecting minigame with falling items, a timer, scoring, and win/lose states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, including login, logout, and identity persistence.",
  "frontend/src/index.css": "Defines global Tailwind styles, color variables, and custom animations for the game's UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with query and identity providers before rendering.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color variables, typography and animation plugins, container settings, and extended fonts and radii.",
  "project_state.json": "Defines the project state for a football game, including feature requests and required stylized images of Ronaldo and game elements."
}