{
  "backend/main.mo": "Minimal Motoko canister defining an empty actor.",
  "feature_evidence.json": "Structured feature-evidence report mapping features to files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend files in the project.",
  "frontend/index.css": "Base Tailwind setup defining color variables and light/dark theme tokens for the site.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component controlling screen progression and rendering all game screens with theme and sound providers.",
  "frontend/src/game/audio/SoundProvider.tsx": "Context provider managing sound effect toggling and generating simple Web Audio API tones for UI events.",
  "frontend/src/game/components/AchievementToast.tsx": "Toast component showing timed achievement notifications with trophy icon and text.",
  "frontend/src/game/components/ChoiceMiniGame.tsx": "Reusable multiple‑choice mini‑game component handling choices, correct/incorrect feedback, retry, and continuation.",
  "frontend/src/game/components/LootChest.tsx": "Displays an interactive loot chest that reveals loot items and a continue button after opening.",
  "frontend/src/game/components/PixelHearts.tsx": "Renders floating animated heart emojis across the screen with randomized positions and delays.",
  "frontend/src/game/components/RewardToast.tsx": "Shows a temporary toast with an icon and message when triggered.",
  "frontend/src/game/components/SoundToggle.tsx": "Button that toggles game sound on or off using the sound provider.",
  "frontend/src/game/components/UnlockSequence.tsx": "Sequentially displays unlockable text items with optional badges and a final message before completing.",
  "frontend/src/game/flow.ts": "Defines screen identifiers, their navigation flow, and a helper to get the next screen.",
  "frontend/src/game/GameShell.tsx": "Layout wrapper applying background, glow effects, and a sound toggle around game content.",
  "frontend/src/game/screens/BootScreen.tsx": "Simulates a loading sequence with staged messages before showing a start button.",
  "frontend/src/game/screens/EndingAchievement.tsx": "Shows a final achievement screen with animations, rewards, and decorative hearts.",
  "frontend/src/game/screens/FakeLoading.tsx": "Displays a fake loading bar with rotating status messages and animated indicators.",
  "frontend/src/game/screens/FinalProposal.tsx": "Presents a proposal sequence with yes/try-again logic, animated hearts, and final progression.",
  "frontend/src/game/screens/index.ts": "Exports all screen components for centralized access within the game flow.",
  "frontend/src/game/screens/Level1OriginStory.tsx": "Uses UnlockSequence to present story beats about how the relationship began.",
  "frontend/src/game/screens/Level2MemoryArena.tsx": "Shows a sequence of shared memories using the UnlockSequence component.",
  "frontend/src/game/screens/Level3Reasons.tsx": "Lists reasons the player is liked and triggers a reward toast before advancing.",
  "frontend/src/game/screens/Level4SupportMission.tsx": "Renders Level 4 support mission with themed text moments and an UnlockSequence that triggers onAdvance when completed.",
  "frontend/src/game/screens/LobbyScreen.tsx": "Displays the game lobby UI with player info, mode, a teammate request, and a START MATCH button invoking onAdvance.",
  "frontend/src/game/screens/MiniGame1Defuse.tsx": "Implements a choice-based mini-game themed around defusing a bad day, using ChoiceMiniGame and calling onAdvance on success.",
  "frontend/src/game/screens/MiniGame2LootChest.tsx": "Shows a LootChest mini‑game that grants a single loot item and advances when opened.",
  "frontend/src/game/screens/MiniGame3Penalty.tsx": "Provides a penalty kick–style choice mini‑game where selecting the correct option triggers onAdvance.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider handling Internet Identity auth, login flow, stored identity loading, and exposing identity state.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom theme variables, game UI classes, and animations for the frontend.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, radius, animations, and enabling additional plugins.",
  "project_state.json": "Project state metadata describing the game concept, requirements, features, and needed assets."
}