{
  "kind": "build_request",
  "title": "Add Ronaldo goal-kick pictures to the Cute Football mini-game",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add new static images to the Cute Football mini-game to depict Cristiano Ronaldo kicking a ball into a goalpost, and update the mini-game UI to display these images during gameplay (idle/aiming, kick action, and goal/miss result states).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can you add pictures in the football game, where ronaldo is kicking the goals into the goalpost"
        ]
      },
      "acceptanceCriteria": [
        "New images are added as static assets under frontend/public/assets/generated using the filenames specified in this build request.",
        "MiniGameCuteFootball renders a Ronaldo-kicking visual scene (player + goalpost) in place of or alongside the current ball/goal visuals.",
        "When the player clicks \"Kick!\", the on-screen visuals clearly reflect a kick moment (e.g., player pose changes and/or ball movement) using the added images.",
        "When the result is a goal, the on-screen visuals clearly reflect a successful shot into the goal (e.g., goal/celebration variant).",
        "When the result is a miss, the on-screen visuals clearly reflect a miss (e.g., miss variant) without breaking existing game flow (attempts, goals, next kick, game over)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx (immutable paths).",
    "Keep all changes within the existing single-frontend app; no new backend logic is required for static images."
  ],
  "nonGoals": [
    "Do not change game rules, difficulty tuning constants, or win/lose conditions beyond what is necessary to render the new images.",
    "Do not add backend storage or fetching of images; images must be served as static assets."
  ],
  "imageRequirements": {
    "required": [
      "Stylized illustration of Cristiano Ronaldo mid-kick (ronaldo-kick.dim_768x768.png)",
      "Stylized illustration of a football goalpost/net (goalpost.dim_768x512.png)",
      "Stylized illustration of a football in motion with motion blur/trail (football-motion.dim_512x512.png)",
      "Stylized illustration of Cristiano Ronaldo celebrating after scoring (ronaldo-celebrate.dim_768x768.png)",
      "Stylized illustration of Cristiano Ronaldo reacting to a miss (ronaldo-miss.dim_768x768.png)"
    ],
    "edits": []
  }
}