{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Level 4, Mini Game 3, Proposal pacing, and Achievement ending copy + badge asset",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make Level 4 (Support Mission) headings and copy match the provided script verbatim, including level label, tagline, appreciation moments, and result text.",
      "acceptanceCriteria": [
        "Level 4 screen displays the provided tagline, appreciation moments, and result text verbatim (including capitalization/punctuation).",
        "Level 4 heading includes the level indicator and \"SUPPORT MISSION\" as specified by the user."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/screens/Level4SupportMission.tsx",
          "operation": "modify",
          "description": "Update the Level 4 title to include the full level label (\"🔴 LEVEL 4 — SUPPORT MISSION\"), set the tagline to exactly \"During difficult matches, teammates stay.\", and replace the two appreciation moment strings to match the script verbatim (including the lowercase \"i\" and \"falling part\"). Ensure the UnlockSequence finalMessage remains exactly \"WE SURVIVED TOGETHER\" and remove any unrelated content from this screen so it matches only the Level 4 script. Uses shadcn-ui Card styling already present; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update Mini Game 3 (Penalty Shootout) prompt/question/choices to match the script exactly and ensure only the intended correct choice yields the success state and text.",
      "acceptanceCriteria": [
        "Mini Game 3 displays the four choices with the same text as provided.",
        "Selecting \"Efforts and showing up\" shows the success title \"GOAL!\" and success subtext \"GOAL SCORED IN JOSHI'S HEART\".",
        "Selecting any other option triggers the mini-game failure flow (no false positives)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/screens/MiniGame3Penalty.tsx",
          "operation": "modify",
          "description": "Change the header prompt text to exactly \"FINAL CHANCE TO SCORE\" (no extra symbols), ensure the question reads exactly \"What always wins her heart?\", and ensure the four choices match the provided wording exactly and in order, with \"Efforts and showing up\" as the only correct answer (correctIndex remains aligned). Keep successTitle \"GOAL!\" and successSubtext \"GOAL SCORED IN JOSHI'S HEART\" verbatim. Uses shadcn-ui Card and the existing ChoiceMiniGame component; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Adjust the Final Proposal sequence to include the scripted pause beats before revealing the DUO MODE REQUEST content.",
      "acceptanceCriteria": [
        "The proposal flow shows the \"Pause…\" and \"New mode?\" beat before the DUO MODE REQUEST content appears.",
        "The DUO MODE REQUEST title and main message appear verbatim as provided."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/screens/FinalProposal.tsx",
          "operation": "modify",
          "description": "Refactor the proposal flow state so it displays \"MISSION COMPLETE\" and \"Solo mode finished.\", then shows the additional beat text \"Pause…\" followed by \"New mode?\" (with pacing via timed transitions and/or an explicit continue), and only then reveals the \"DUO MODE REQUEST\" title and the main message \"This game (of life) has been a lot more fun with you in it.\" verbatim. Keep existing YES interaction and advancement behavior intact. Uses shadcn-ui Card/Button already present; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure the Ending/Achievement screen copy matches the provided script after YES: title, achievement name, rewards list text, and final quote.",
      "acceptanceCriteria": [
        "Ending screen title reads \"ACHIEVEMENT UNLOCKED\" and includes \"Valentine Partner 2026\".",
        "Rewards list contains exactly 3 items with the same text as provided.",
        "The quote \"Best matches are played with great teamwork.\" is displayed verbatim on the ending screen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/screens/EndingAchievement.tsx",
          "operation": "modify",
          "description": "Verify and adjust the Ending/Achievement screen strings so they match the script verbatim: title \"ACHIEVEMENT UNLOCKED\", achievement name \"Valentine Partner 2026\", exactly three rewards (same wording and order as provided), and the final quoted line \"Best matches are played with great teamwork.\" (including punctuation). Keep the screen as the post-YES destination only (no new navigation). Uses shadcn-ui Card styling already present; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add the generated achievement badge PNG as a static asset and render it on the Ending/Achievement screen.",
      "acceptanceCriteria": [
        "A 512x512 PNG badge image exists at frontend/public/assets/generated/valentine-achievement-badge.dim_512x512.png.",
        "Ending/Achievement screen displays the badge image without requesting it from the backend (served as a static asset)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/valentine-achievement-badge.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated 512x512 PNG achievement badge asset at frontend/public/assets/generated/valentine-achievement-badge.dim_512x512.png so it is served as a static frontend file."
        },
        {
          "path": "frontend/src/game/screens/EndingAchievement.tsx",
          "operation": "modify",
          "description": "Ensure the Ending/Achievement screen renders the badge image from the static asset path frontend/public/assets/generated/valentine-achievement-badge.dim_512x512.png (no backend fetch), and that its placement remains consistent with the achievement header. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}